spairot/M3H6_Blink/Libraries/CMSIS/startup/iar/startup_TMPM3H3.s
                PUBWEAK INTUART0RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTUART0RX_IRQHandler
                B       INTUART0RX_IRQHandler

                PUBWEAK INTUART0TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTUART0TX_IRQHandler
                B       INTUART0TX_IRQHandler

                PUBWEAK INTUART0ERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTUART0ERR_IRQHandler
                B       INTUART0ERR_IRQHandler

                PUBWEAK INTUART1RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTUART1RX_IRQHandler
                B       INTUART1RX_IRQHandler

                PUBWEAK INTUART1TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTUART1TX_IRQHandler
                B       INTUART1TX_IRQHandler

                PUBWEAK INTUART1ERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTUART1ERR_IRQHandler
                B       INTUART1ERR_IRQHandler

                PUBWEAK INTUART2RX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTUART2RX_IRQHandler
                B       INTUART2RX_IRQHandler

                PUBWEAK INTUART2TX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTUART2TX_IRQHandler
                B       INTUART2TX_IRQHandler

                PUBWEAK INTUART2ERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTUART2ERR_IRQHandler
                B       INTUART2ERR_IRQHandler

                PUBWEAK INTT32A0A_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A0A_IRQHandler
                B       INTT32A0A_IRQHandler

                PUBWEAK INTT32A0ACAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A0ACAP0_IRQHandler
                B       INTT32A0ACAP0_IRQHandler

                PUBWEAK INTT32A0ACAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A0ACAP1_IRQHandler
                B       INTT32A0ACAP1_IRQHandler

                PUBWEAK INTT32A0B_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A0B_IRQHandler
                B       INTT32A0B_IRQHandler

                PUBWEAK INTT32A0BCAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A0BCAP0_IRQHandler
                B       INTT32A0BCAP0_IRQHandler

                PUBWEAK INTT32A0BCAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A0BCAP1_IRQHandler
                B       INTT32A0BCAP1_IRQHandler

                PUBWEAK INTT32A0C_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A0C_IRQHandler
                B       INTT32A0C_IRQHandler

                PUBWEAK INTT32A0CCAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A0CCAP0_IRQHandler
                B       INTT32A0CCAP0_IRQHandler

                PUBWEAK INTT32A0CCAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A0CCAP1_IRQHandler
                B       INTT32A0CCAP1_IRQHandler

                PUBWEAK INTT32A1A_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A1A_IRQHandler
                B       INTT32A1A_IRQHandler

                PUBWEAK INTT32A1ACAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A1ACAP0_IRQHandler
                B       INTT32A1ACAP0_IRQHandler

                PUBWEAK INTT32A1ACAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A1ACAP1_IRQHandler
                B       INTT32A1ACAP1_IRQHandler

                PUBWEAK INTT32A1B_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A1B_IRQHandler
                B       INTT32A1B_IRQHandler

                PUBWEAK INTT32A1BCAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A1BCAP0_IRQHandler
                B       INTT32A1BCAP0_IRQHandler

                PUBWEAK INTT32A1BCAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A1BCAP1_IRQHandler
                B       INTT32A1BCAP1_IRQHandler

                PUBWEAK INTT32A1C_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A1C_IRQHandler
                B       INTT32A1C_IRQHandler

                PUBWEAK INTT32A1CCAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A1CCAP0_IRQHandler
                B       INTT32A1CCAP0_IRQHandler

                PUBWEAK INTT32A1CCAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A1CCAP1_IRQHandler
                B       INTT32A1CCAP1_IRQHandler

                PUBWEAK INTT32A2A_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A2A_IRQHandler
                B       INTT32A2A_IRQHandler

                PUBWEAK INTT32A2ACAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A2ACAP0_IRQHandler
                B       INTT32A2ACAP0_IRQHandler

                PUBWEAK INTT32A2ACAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A2ACAP1_IRQHandler
                B       INTT32A2ACAP1_IRQHandler

                PUBWEAK INTT32A2B_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A2B_IRQHandler
                B       INTT32A2B_IRQHandler

                PUBWEAK INTT32A2BCAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A2BCAP0_IRQHandler
                B       INTT32A2BCAP0_IRQHandler

                PUBWEAK INTT32A2BCAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A2BCAP1_IRQHandler
                B       INTT32A2BCAP1_IRQHandler

                PUBWEAK INTT32A2C_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A2C_IRQHandler
                B       INTT32A2C_IRQHandler

